// Напишите программу, которая принимает на вход число (А)  и выдает сумму чисел от 1 до А

Console.Clear();
Console.Write("Введите число: ");
double a = Convert.ToDouble(Console.ReadLine());
Console.WriteLine($"Результат: {(a + 1)/ 2 * a}");

